{
  "001": {
    "title": "A Fake Blog Post",
    "image": "images/blog/Firefox-styleEditor.png",
    "imageOrientation": "landscape",
    "imageAlt": "A Firefox window with the Style Editor opened",
    "snippet": "This is the first in a series of fake blog posts that I'm going to write so I have something to mess with when formatting the blog.",
    "fullText": "<p>At the beginning of 2013, I put some goals for the gym on the blog. I figure now is an appropriate time to check in on those goals, and to set some goals for 2014:</p><p><strong>Goals from 2013:</strong></p><p>– All current members doing unassisted pullups in WODs<br><em>We did pretty well on this one. Many of our members from January 2013 have at least a few unassisted pull-ups, and those who don’t have progressed mightily in terms of the scalings they use.</em></p><p>– Members placing in top 10 of local/regional competitions (because we know we’re badass enough to do it)<br><em>Failsauce. This one was my fault — we had a number of members who did a few competitions and performed well, but never got organized as a gym around any one event.</em></p><p>– More team WODs (because they’re the most ridiculously fun way to kick your own butt)<br><em>Great success! We do team WODs on most weekends, and it makes our Saturday classes some of the most fun I’ve ever had in the realm of exercise!</em></p><p>– Attendance/membership increased enough to merit/necessitate adding more classes<br><em>This happened. We’ve added a 5 a.m., 9 a.m., 12:15 p.m., and 7:30 p.m. class this year. Sadly, we lost our 7 a.m. class, but we still added 3 new class times while also increasing the average number of attendees per class.</em></p><p>– World domination<br><em>Getting close…</em></p><p><strong>And now, some goals for 2014:</strong></p><p>– Have at least half of all Manatees complete the <a href='http://games.crossfit.com/about-the-games' target='_blank'>CrossFit Open<br></a></p><p>– Be more involved in local events (5k’s, CrossFit competitions, etc.)</p><p>– Improve our offerings outside of classes (more on this next week)</p><p>– Get our average Fran time under 8 minutes</p><p>– World domination! (again)</p>"
  },
  "002": {
    "title": "A Newbie's CSS Workflow Trick",
    "image": "images/blog/Firefox-styleEditor.png",
    "imageOrientation": "landscape",
    "imageAlt": "A Firefox window with the Style Editor opened",
    "snippet": "A simple discovery in Firefox's Style Editor -- which I probably should’ve found long ago -- helped me significantly speed up my CSS writing and debugging process.",
    "fullText": "<p>When I’m working on a front-end project, I’m almost always working with files stored locally, doing everything from project setup to final debugging on my trusty little laptop. I don’t have a fancy dual-screen workstation, so I’m constantly switching between windows -- from my terminal to my text editor to my browser, back to my text editor, etc, etc.</p><p>One of the most annoying pieces of front-end development in this workflow, which I think is a typical pattern for many beginning front-end developers or professionals working remotely, is writing and debugging my CSS. Or rather, this was annoying until I found out that Firefox’s Style Editor can almost completely eliminate this pain point for me.</p><p>Here’s what I used to do when writing my CSS: First, I’d apply styling classes to my HTML or JSX and link a fresh stylesheet. Then. I’d open up the new CSS file in my text editor and apply the rules that I thought would style my content how I wanted it. I’d save my work, open up the project in a browser, and see how it looked. I’d either experiment with changes in the inspector or just eyeball the adjustments I needed to make, and then I’d then go back to the text editor and make the edits. I’d repeat ad nauseum until the styling was correct, clicking back and forth between my text editor and my browser over and over again… It was a frustratingly slow and clumsy process.</p><p>But then I discovered something that most experienced developers probably take for granted: If you’re modifying a locally-saved stylesheet in Firefox’s Style Editor, you can save your changes to that stylesheet directly from Firefox. It’s not even hard -- all you have to do is hit ctrl-s or cmd-s while you have the stylesheet selected, or just click the handy-dandy “Save” link that pops up next to the filename in the Style Editor window. That’s it. It’s so simple, and so powerful, and it saves me so much time when I’m debugging some weird CSS issue.</p><p>However, with great power comes great responsibility. If you’re in the habit of hitting save frequently as you work, editing your CSS from the Style Editor can be risky. It’s hard to backtrack changes that you’ve made from the Style Editor -- you can’t just hit “undo” like you can in your text editor. And if, like me, you’re used to experimenting in your browser’s Dev Tools, knowing that you can just reload the page if you screw things up too badly, you could accidentally end up saving a CSS file that has all sorts of exotic rules written in, and that you can’t easily revert back to the previous version.</p><p>Despite the dangers, if you’re a front-end developer who does your coding locally on a single-monitor machine, writing and saving your CSS from within the Firefox Style Editor can really speed up the styling process, saving you a huge amount of time and frustration. So give it a shot!</p>"
  },
  "003": {
    "title": "Fake Blog Posts Are the Best!",
    "image": "images/blog/Firefox-styleEditor.png",
    "imageOrientation": "landscape",
    "imageAlt": "A Firefox window with the Style Editor opened",
    "snippet": "Why write real blog posts, when you could just write little fake ones all day?!",
    "fullText": " <p>Do. Not. Stop.</p><p>The <a href='http://games.crossfit.com/workouts/the-open' target='_blank'>last workout of the 2015 CrossFit Open</a> is what many of you have been both hoping for and dreading: A pure, straightforward test of physical stamina and mental fortitude. There are no muscle-ups or double-unders to slow you down. There is no time cap to save you. There is just a big ol’ pile of rowing and thrusters, and you must work your way through the whole dang thing.</p><p>So let’s break it down and talk about what you can do to get your best possible score in this grand finale WOD:</p><h3>Rowing</h3><p>There are a lot of different opinions out there about how to approach this row. Some people say that, since you get more bang for your buck out of going hard when rowing for calories than rowing for meters, you should hit the row hard. I think those people have never done thrusters.</p><p>I’m in the camp that believes the rowing is your rest. If you absolutely kill yourself on the rower, you might be able to finish the round of 27 calories on the rower a few seconds earlier than if you took it easy. However, a better plan is to take it a little bit easier on the row so that you’re ready to get straight to the barbell and start those thrusters immediately once the row is done.</p><p>The pacing can be a little tricky on these, since we’re used to thinking about our rowing pace in terms of time per 500m, as opposed to calories per hour. So here’s a handy little guide to help you figure out what your rowing pace should be:</p><table border='1'><tbody><tr><td><strong>If a fast 500m row for me is:</strong></td><td><strong>Then a good cal/hr pace would be:</strong></td><td><strong>Which would have me finish 27 cal in about:</strong></td></tr><tr><td>1:30-1:45</td><td>1350-1600</td><td>1:00-1:10</td></tr><tr><td>1:45-2:00</td><td>1100-1300</td><td>1:15-1:25</td></tr><tr><td>2:00-2:15</td><td>800-1050</td><td>1:35-2:00</td></tr></tbody></table><p> </p><p>Translating meters to calories is an inexact science at best, and rowing pace is going to vary widely from person to person based on height, strength, and other factors. But the table above should get you generally in the right neighborhood, and from there you’ll be able to find a comfortable pace.</p><p>The main thing on the rower is to pace it out and finish with plenty of gas to get right on the thrusters, especially in the rounds of 27 and 21. I’d even advise taking it super-easy on the last 2-3 calories, coasting to the end of the rowing piece so you can attack the thrusters quickly. Once you get to the 15’s and 9’s, you should be able to push a little harder as the finish line nears.</p><p>If your rowing technique is fishy, now is the time to <a href='https://www.youtube.com/watch?v=tohp65yGZNs'>clean it up</a>:</p><p><iframe src='https://www.youtube.com/embed/tohp65yGZNs' allowfullscreen='allowfullscreen' width='560' height='315' frameborder='0'></iframe></p><h3>Thrusters</h3><p>The thrusters are where the rubber meets the road for this WOD. First, you’ll want to make sure your movement is efficient. This means that you should take the time you need to make sure your hips and ankles are sufficiently mobilized so that your torso stays nice and upright during the squat. Also pay attention to your shoulders and wrists, so you can maintain a good rack position and an efficient transition from the squat to the overhead portion of the thruster.</p><p>I recommend Olympic lifting shoes for this WOD, as they will help greatly with the thrusters. You may want to spend a couple of minutes practicing getting in and out of the rower in your olys if you’re not used to rowing in them, but other than that, they won’t be a hindrance to you on the row, and they’ll help greatly on the thrusters.</p><p>The trick to the thrusters is to get on the bar <em>immediately</em> once you’re done with the row, and to keep your break times short. This is all about mental strength. You will not want to do one more thruster. You will not want to get back on the bar. Do it anyway.</p><p>Your strategy here will vary based on how strong you are and how much thrusters hurt for you, but the basic concepts will remain the same for everyone:</p><ol><li>Don’t worry about cycle time (how fast you do each individual thruster). Instead, focus on continuous movement — keep going for as many reps as you can without crossing that red line.</li><li>When you do stop, control your break time. One good strategy for this is to walk in a pre-determined loop — walk once around your rower, for example, then pick the bar up immediately once you get back to it.</li><li>Do not put your hands on your knees. Do not kneel on the ground. Do not get chalk. Do not grab water. Do not look around at what other athletes are doing. You do not need to do these things. You need to get through the thrusters as quickly as you can. So do thrusters.</li></ol><h3>General Strategery</h3><p>This is the last WOD of the 2015 CrossFit Open. For most of us, this is the last WOD of CrossFit’s competitive season. Hit it hard. Push yourself. Leave it all on the floor. This is the last chance you’ll have to climb up a few spots on the leaderboard and show off your mad CrossFit skillz… until 2016.</p><p>Take it easy on the row. Bust through those thrusters as ruthlessly as possible. Enjoy the ride. And then get excited for a new cycle of programming, and getting back to some stuff that we haven’t seen in a little while!</p>"
  },
  "004": {
    "title": "This Is Definitely a Real Blog Post",
    "image": "images/blog/Firefox-styleEditor.png",
    "imageOrientation": "landscape",
    "imageAlt": "A Firefox window with the Style Editor opened",
    "snippet": "In the history of blog posts, there has never been a blog post that has been more real than this one.",
    "fullText": "<p>The single biggest element in your success in CrossFit, or in anything, is simply <a href='http://crossfitmanatee.com/2013/02/14/02-15-13-friday-showing-up/'' target='_blank' rel='noopener'>showing up every day</a> and putting in the work. If your only strategy to improve your health and fitness is to get to the gym every single day and do what your coaches tell you to do, then you’ll do just fine. Heck, you’ll do better than fine — you’ll get into the best shape of your life.</p><p>But there are other things you can do in or around that hour of time you’ve dedicated to the gym to get even more out of your CrossFit experience. Here are three simple ways to super-charge your gym experience:</p><h3>Show up 5 minutes early</h3><p>Dedicate those five minutes before class working on something that you really, really suck at. Spend the time in a stretch that is particularly challenging for you, or working on a skill that you can’t quite grasp. Getting to the gym five minutes early isn’t that hard, and those little increments of time spent working on your weaknesses will add up quickly.</p><h3>Focus on the task at hand</h3><p>When you’re doing your Foundation work, don’t think ahead to the WOD. When you’re doing the WOD, don’t worry about how you did in the Foundation, or what’s coming up tomorrow. Simply focus on giving every ounce of effort that you possibly can to completing the task in front of you at this moment. You’ll be surprised at how tuning the rest of the world out and giving your complete attention to your current task will make your workouts more rewarding, and will help your results improve more quickly.</p><h3>Re-fuel</h3><p>When you exercise, you make your body weaker, slower, and less fit. It’s what your body does to <a href='http://crossfitmanatee.com/2013/11/10/11-11-13-monday-what-is-recovery/' target='_blank' rel='noopener'>recover from exercise</a> that makes you stronger, faster, and more fit. The best way to jump-start that recovery process and get the most out of the rebuilding time between the workout you just finished and tomorrow’s WOD is to give your body some good fuel immediately after working out. This can come in the form of a protein shake, a bar, or a small meal. Giving your body the tools to recover from the workout within half an hour of exercising will really improve your recovery and help you see results more quickly.</p><p>You’ve already made the big commitment of spending an hour each day working on your own health and fitness. These three simple steps don’t require much time or energy, and they’ll help you make the most out of your time in the gym.</p>"
  }
}
